package l6;

public class e3 {
        
    /**
     * Вариант 2. Задача 5.
     * Во входном файле расположены два набора положительных чисел;
     * между наборами стоит отрицательное число. Построить два
     * списка C1 и С2, элементы которых содержат соответственно
     * числа 1-го и 2-го набора таким образом, чтобы внутри одного
     * списка числа были упорядочены по возрастанию. Затем
     * объединить списки C1 и С2 в один упорядоченный список,
     * изменяя только значения полей ссылочного типа.
     */
    public static void main(String[] args) {

     }
 }