package l5;

public class e6 {
    
    /**
     * Вариант 3. Задача 6.
     * Требуется ввести последовательность строк из текстового потока и выполнить указанные действия.
     * При этом могут рассматриваться два варианта:
     *     - каждая строка состоит из одного слова; 
     *     - каждая строка состоит из нескольких слов
     * 
     * В каждой строке стихотворения Анны Ахматовой подсчитать
     * частоту повторяемости каждого слова из заданного списка и
     * вывести эти слова в порядке возрастания частоты повторяемости. 
     */

    public static void main(String[] args) {

    }
}