package l8;

public class e1 {
    /**
     * Вариант 1. Задача 3.
     * Реализовать многопоточное приложение “Магазин”.
     * Вся цепочка: производитель-магазин-покупатель. Пока
     * производитель не поставит на склад продукт,
     * покупатель не может его забрать. Реализовать приход
     * товара от производителя в магазин случайным числом.
     * В том случае, если товара в магазине не хватает –
     * вывести сообщение.
     */
    public static void main(String[] args) {
               
    }
}
